package view;

import java.util.Random;
import java.util.Scanner;

import util.ScanUtil;

public class Print {
	
	public String resID() {
		String charset = "ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789";
	       int charsetLength = charset.length();
	       Random random = new Random();
	       StringBuilder randomString = new StringBuilder();
	       // 9자리의 난수 생성
	       for (int i = 0; i < 9; i++) {
	           // 랜덤한 인덱스를 생성하여 해당 인덱스의 문자를 추출하여 문자열에 추가
	           randomString.append(charset.charAt(random.nextInt(charsetLength)));
	       }
	       return randomString.toString();
	 }
	public String Ticket() {
		
//		 System.out.println(ticket); 
		 return null;
	 }

    public String getDepart() {
        System.out.println("1. 대한민국\n2. 일본\n3. 중국\n4. 미국");
        return ScanUtil.nextLine("출발지를 선택하세요: ");
    }
    public String getArrive() {
        System.out.println("1. 대한민국\n2. 일본\n3. 중국\n4. 미국");
        return ScanUtil.nextLine("도착지를 선택하세요: ");
    }
	
    public int tiekckPrice(String depart, String arrive) {
		 int ticket_price = 0;
		    if(depart.equals("대한민국")) {
		         if(arrive.equals("대한민국")) ticket_price = 50000;
		         else if(arrive.equals("일본")) ticket_price = 200000;
		         else if(arrive.equals("중국")) ticket_price = 400000;
		         else if(arrive.equals("미국")) ticket_price = 3000000;
		    }
		    else if(depart.equals("일본")) {
		    	 if(arrive.equals("대한민국")) ticket_price = 200000;
		         else if(arrive.equals("일본")) ticket_price = 100000;
		         else if(arrive.equals("중국")) ticket_price = 400000;
		         else if(arrive.equals("미국")) ticket_price = 2700000;
		    }
		    else if(depart.equals("중국")) {
		    	 if(arrive.equals("대한민국")) ticket_price = 400000;
		         else if(arrive.equals("일본")) ticket_price = 400000;
		         else if(arrive.equals("중국")) ticket_price = 200000;
		         else if(arrive.equals("미국")) ticket_price = 3200000;
		    }
		    else if(depart.equals("미국")) {
		    	 if(arrive.equals("대한민국")) ticket_price = 3000000;
		         else if(arrive.equals("일본")) ticket_price = 2700000;
		         else if(arrive.equals("중국")) ticket_price = 3200000;
		         else if(arrive.equals("미국")) ticket_price = 500000;
		    }
		    return ticket_price;
	 }
	public void println() {
		System.out.println();
	}
    public void println(int num) {
    	for(int i = 0; i < num ;i++) {
    		System.out.println();
    	}
    }
    public void printTopvar() {
    	System.out.println("┌──────────────────────────────┐");  						
    }
	public void printMidvar() {
		System.out.print("│");
	}
	public void printMidvar(int num) {
		for(int i = 0; i < num; i++) {
		System.out.println("│							   │");
		}
	}
	public void printBotvar() {
		System.out.println("└──────────────────────────────┘");
	}
	public void printVar() {
		System.out.println("────────────────────────────────");

	}
	public void homeVar() {
		  printTopvar();
	      System.out.println("│1. 회원 관리                                         │");
	      System.out.println("│2. 항공편 조회                                      │");
	      System.out.println("│3. 항공편 예약                                      │");
	      System.out.println("│4. 예매권 조회 및 취소                           │");
	      System.out.println("│5. 게시판                                             │");
	      System.out.println("│6. 재로그인                                          │");
	      printBotvar();
	}
	public void flightImage() {
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⡄⠀⠀⠀⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀⠀⢀⠀⠀⠀⠀⣀⠀⠀⠀⣄⠀⠀\r\n" + 
				"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⠀⠀⣀⣃⣀⣀⣀⡘⠀⠀⠀⢸⠀⠀⠀⠀⠀⠀⠀⠀⢘⠀⠀⠀⠀⠀⠀⠀⠀⠃⠀⠀⠀⠀⠀⠀⠀⢸⠀⠀⠀⠀⣿⠀⠀⠀⣿⠀⠀\r\n" + 
				"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡇⢸⣿⣿⣿⣉⢙⡏⠻⠿⡿⣷⣾⣦⣤⣤⣄⣛⣀⠀⠀⢼⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⠨⠤⠤⠤⠤⣿⣤⣤⣤⣽⠀⠀\r\n" + 
				"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠀⠈⠙⠻⣿⣿⣿⣤⣄⠀⡤⠾⣿⣿⣶⣾⣿⣿⣿⣿⣿⣷⣶⣶⣤⣬⣀⣀⡀⠀⠀⣀⣠⡴⠖⠚⠉⠀⠀⠀⠀⠀⠀⠠⣿⣿⣿⣳⣦⠀\r\n" + 
				"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡆⠀⠀⠀⣦⠙⠻⢿⣿⣶⡶⣶⣶⢟⣹⢿⣿⣿⣿⣿⣿⣿⣿⣿⣟⣿⣿⠿⠟⠛⢉⡉⢀⡀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣽⣿⣿⣿⣿⡇\r\n" + 
				"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⡇⠀⠀⠉⡇⠀⠀⠀⢩⠛⢿⣿⣿⣤⣜⣿⣬⣭⣿⣾⣯⣽⠿⠟⠋⠉⣀⠀⣴⣷⡄⠓⠚⠳⠀⠀⠀⣀⣤⣴⣾⣿⣿⣿⣿⣿⣿⣿⠟⠀\r\n" + 
				"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⠀⠀⠀⡇⠀⠀⠀⢸⡀⠀⠈⠙⠻⢿⣿⣿⡿⠟⠋⢉⣀⠀⣴⣦⡶⣿⣿⡝⠟⠛⣀⣀⣤⣶⣾⣿⣿⣿⣿⣿⣿⡿⠿⠛⠋⠁⢸⠀⠀\r\n" + 
				"⠀⠀⠀⠀⠀⠀⢠⠀⠀⠀⢰⠀⠀⠀⠀⢿⠀⠀⠘⣿⠁⢀⣠⡤⠶⠚⣋⣄⡀⣴⣦⡸⣿⡟⠛⠟⠃⢉⣠⣤⣶⣿⣿⣿⣿⣿⣿⣿⡿⠿⡟⠉⠁⠀⡆⠀⠀⠀⢹⠀⠀\r\n" + 
				"⠀⣀⣤⣄⡀⠀⢸⠀⠀⠀⢸⠀⠀⠀⠀⢠⢀⣠⡴⠿⠛⢉⣁⣐⣾⣧⣿⣿⡿⠿⠟⠃⣉⣠⣴⣶⣿⣿⣿⣿⣿⣿⣿⠿⠟⢻⠉⠀⠀⠀⡇⠀⠀⠀⡇⠀⠀⠀⢸⠀⠀\r\n" + 
				"⠘⢻⣿⣿⣿⣷⣦⣄⡀⠀⠀⣄⣠⡤⠖⠛⠉⠁⣠⣶⣦⣾⣿⡏⠿⠏⠁⣁⣡⣴⣾⣿⣿⣿⣿⣿⡳⣷⣿⠟⠛⡏⠀⠀⠀⢸⠄⠀⠐⢲⠇⠀⠀⠚⠗⠀⠀⠀⠀⠀⠀\r\n" + 
				"⠀⠈⠻⢿⣿⣯⣿⠿⠿⠓⠛⠉⠁⠀⠀⠀⠀⠀⠛⠿⠏⠉⣁⣠⣴⣾⣿⣿⣿⣿⣿⢉⣽⣿⣿⣿⣿⡿⣿⣦⠀⡇⠀⠀⠀⢸⠀⠀⠀⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n" + 
				"⠀⢀⣴⠼⠿⠉⠀⢀⣀⣴⡄⠀⠀⠀⠀⠀⠀⣀⣤⣴⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⣾⣿⣿⣿⣿⠟⠀⢸⣿⣇⣧⠀⠀⠀⢜⠀⠀⠀⠈⠀⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀\r\n" + 
				"⠀⢸⣿⣷⣶⣶⣾⣿⣿⣿⣦⣤⣤⣤⣶⣾⣿⣿⣿⣿⣿⣿⡿⠿⡟⠋⠁⣿⣿⣿⣴⡿⢻⣿⡿⡥⢴⠖⠚⠋⠉⣿⠀⠀⠀⠈⠀⠀⠀⠀⡀⢀⠀⢄⡇⠀⠀⠀⠀⠀⠀\r\n" + 
				"⠀⠀⣉⣛⠛⢻⣿⣿⣿⡟⠻⡟⠛⠛⢛⡛⠛⠋⠉⢹⠁⠀⢀⣠⡇⠀⣸⣿⣿⣿⣿⣿⣿⠟⠀⠀⢼⡄⠀⠀⣀⡿⠀⠀⠀⠀⠀⠀⠀⣰⡟⠋⠀⠀⢹⡆⠀⠀⠀⠀⠀\r\n" + 
				"⠀⠀⠀⠀⠀⠈⣿⡿⠟⠀⠀⡇⠀⠀⠈⡇⠀⠀⠀⢸⠀⠀⠀⢸⠀⢀⣿⣿⣿⣿⣿⡿⣧⠀⠀⠀⠀⡇⠀⠀⠀⡇⠀⠀⠀⠀⠀⠀⠀⢸⠋⠉⠉⠉⣿⠁⠀⠀⠘⠀⠀\r\n" + 
				"⠀⠀⠀⠀⠀⢀⣿⠀⠀⠀⢀⡇⠀⠀⢀⡇⠀⠀⠀⢸⠀⠀⠀⢸⠀⣾⣿⣿⣿⣿⠟⣀⣽⠀⠀⠀⠀⠃⠀⠀⠀⠃⠀⠀⠀⢸⠀⠀⠀⠸⠀⠀⠀⠀⠉⠀⠀⠀⠀⠀⠀\r\n" + 
				"⠀⠀⠀⠀⠀⠀⢸⠉⠀⠈⢹⠁⠀⠀⠀⠉⠀⠀⠀⠸⠀⠀⠀⠈⡟⠿⠿⠟⡏⠀⠀⠀⢸⠁⠀⠀⢸⠀⠀⠀⠀⣴⡶⠀⠉⠻⣄⠀⠀⠀⠆⠀⠀⠀⡆⠀⠀⠀⠀⠀⠀\r\n" + 
				"⠀⠀⠀⠀⠀⠀⠸⠀⠀⠀⠸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⠀⠀⢀⡇⠀⠀⠀⢸⠀⠀⠀⠀⠀⢀⡴⠞⠋⠀⠀⠀⠀⠈⠳⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
	}
	public void textImage() {
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n" + 
				"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣶⣿⣶⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n" + 
				"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣤⣄⣀⣤⠀⠀⠠⠀⠀⠀⠀⢀⠀⠀⠀⠀⠀⣈⣻⣿⣿⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣄⠀⢠⡊⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n" + 
				"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣽⣿⣿⣿⣶⣶⣾⣶⣶⠀⠀⠈⠀⠀⠀⠀⣾⣿⣿⣿⣿⡿⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣶⣿⣿⣶⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠐\r\n" + 
				"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠠⣤⡀⠀⢀⠀⢿⣿⡿⠿⠿⠁⢀⣠⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⠀⠀⠀⠠⠀⠀⠀⢀⣿⣿⣿⣿⣿⣿⠻⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠤⠄⠀⠀⠀⣀⡀⠀⠀⠀⠀⠀⠀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣀⠀⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n" + 
				"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣤⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠀⠀⢻⣥⣄⣼⣷⣾⣿⣧⡀⠀⢀⣼⣿⣶⣤⣀⠀⢀⣾⣷⣤⣤⣴⣶⣶⣦⣄⠀⠀⣀⣼⣿⣷⣄⠀⠀⠀⠀⢰⣿⣿⣿⣿⣿⠟⠁⠀⢸⣷⣶⣶⣶⣶⣶⣦⣤⡀⠀⠀⠀⠀⢾⣿⣿⣶⣄⠀⠀⣠⣾⣿⣷⣤⡀⠀⠀⠀⠀⠀⠀⣠⣤⣿⣿⣿⣿⣷⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀\r\n" + 
				"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⣿⣿⣿⣿⣿⢿⣿⣿⣿⣿⣿⣦⠀⠀⠀⢿⣿⣿⣿⣿⣿⣿⣿⣦⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⡤⢤⣤⣼⣿⣿⣿⣿⣿⣦⣤⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⣤⣤⣴⣿⣿⣿⣿⣿⣷⣾⣿⣿⣿⣿⣿⣿⣶⣤⣀⣀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⡄⢠⠀⠀⠀⠀⠀\r\n" + 
				"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣤⣶⣿⣿⣿⣿⡿⠁⢨⣿⣿⣿⣿⣿⣅⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⢿⣿⣯⣿⣿⣿⣿⣿⡿⠛⠻⣿⣿⣿⣿⣿⣿⣥⣤⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠛⠛⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠛⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠻⣿⣿⣿⣿⣿⠁⢸⡄⡄⠀⠀⠀\r\n" + 
				"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⣿⣿⣿⣿⣿⣋⣀⣀⣸⣿⣿⣿⣿⣿⠛⠃⠀⠙⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠛⠁⠀⠀⢀⣿⣿⣿⣿⣿⠛⠃⠀⠀⣿⣿⣿⣿⣿⡟⢻⣿⣿⣿⣿⣿⣿⣿⢟⣁⣀⣤⣤⣤⣴⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠆⠸⠀⠀⠀⠀⠀\r\n" + 
				"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠷⣶⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⣶⣿⣿⣿⣿⣿⣿⠀⠀⢠⣴⣿⣿⣿⣿⣿⡇⢸⣿⣿⣿⣿⣿⠛⢣⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠗⠀⣤⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠁⠀⠀⠀⠀⠀⠀⠀\r\n" + 
				"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⣿⣿⣿⠀⠀⠀⣸⣿⣿⣿⣿⣿⠀⠀⣸⣿⣿⣿⣿⠛⠋⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣦⣴⣾⣿⣿⣿⣿⣿⠀⢀⣼⣿⣿⣿⣿⣟⣠⣿⣿⣿⣿⣟⣁⣀⣀⣼⣿⣿⣿⣿⡇⠀⣈⣿⣿⣿⣿⣟⠁⠀⠀⣿⣿⣿⣿⣿⣿⠁⠈⣿⣿⣿⣿⣿⣇⣀⣀⣸⣿⣷⣿⣿⣿⣿⠀⠃⠈⠀⠀⠀⠀⠀\r\n" + 
				"⠀⠀⠀⠀⠀⠀⠀⠀⢀⣼⣿⣿⣿⣿⣿⠉⠀⠁⠀⠀⠀⢸⣿⣿⣿⣿⣿⠀⠀⣸⣿⣿⣿⣿⣿⠟⢶⣼⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋⣉⠀⣾⣿⣿⣿⣿⡟⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡅⣾⣿⣿⣿⣿⣿⠋⠀⣠⣾⣿⣿⣿⣿⣿⡏⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀\r\n" + 
				"⠀⠀⠀⠀⠀⠀⠀⠀⠻⠿⠿⠿⢿⣿⠟⠀⠀⠀⢀⠀⠀⠈⠻⠿⠿⠿⠿⠀⠀⢻⣿⡿⠿⢿⣿⠀⠀⣿⠿⠿⠿⠟⠁⠀⠷⢠⣄⣴⣿⣿⣿⣿⣿⠈⠹⠿⠿⠿⠟⠛⠋⠀⠀⠉⠀⠿⠿⠿⢿⣿⠇⠀⠈⠻⢿⠿⠿⠿⠛⠛⠻⠿⠿⠿⠿⠛⠁⠻⠿⠿⠿⣿⠿⠀⠀⠙⠿⠿⠿⠿⢿⣿⡇⠀⠀⡀⢹⣿⠿⠿⠿⠿⠿⠟⠛⠛⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n" + 
				"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡄⠁⠀⠀⠀⠀⢸⠀⠀⠀⠀⠀⡶⠀⠀⠀⠀⠘⠛⠀⠀⠘⢿⠀⠐⠃⠀⠀⡶⠀⠀⠀⠀⠀⣹⣿⣿⣿⣿⣿⠟⢀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⡆⠀⠀⠀⠘⢶⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠛⠀⠀⠀⠀⠀⠐⠂⠀⠀⢻⡇⠀⠸⡇⢸⣿⣶⢰⣶⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n" + 
				"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢼⣿⣿⣿⣿⣿⣿⠃⢸⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠁⠀⠀⠀⠀⠀⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⠀⠉⠀⠀⢈⠤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n" + 
				"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠛⠛⠻⡿⢿⠉⠀⢸⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠁⠀⠀⠑⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n" + 
				"⠀⠀⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⠾⠀⠀⠸⠟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
	}
	
       
}	    


	
      


	    

